# DataFrame_Pandas

## Boolean

In [9]:
print(True == False)
print(True == True)
print(True != 0)
print(False == 0)
print(True or False)
print(1 == '1')
print(False == 'false')

False
True
True
True
True
False
False

In [5]:
True == False

False

In [64]:
True != True

False

## 문자열

In [12]:
eng = 'Korea COVID 19'
eng.lower()

'korea covid 19'

In [14]:
eng.upper()

'KOREA COVID 19'

In [65]:
eg = 'Hi'

In [66]:
eg.lower()

'hi'

In [67]:
eg.upper()

'HI'

## Lists[]

In [17]:
data = []
t=()
d={}

In [19]:
type(data),type(t),type(d)

(list, tuple, dict)

In [24]:
data = []
data.append('java')
print(data[0],data[-1],data[1:],data[:2])

java java [] ['java']

In [23]:
data.sort()
print(data)

['java']

In [68]:
data.reverse()
print(data)

['java']

In [71]:
dato =[]
dato.append(1)

In [72]:
dato[0],dato[-1]

(1, 1)

## Tuple()

In [29]:
b=(1,2,3,'사','오')
c=1,2,3
type(b),type(c)

(tuple, tuple)

In [31]:
b[3] = 4 # 튜플의 요소는 기본적으로는 바꿀수없다.

TypeError: 'tuple' object does not support item assignment

In [73]:
b[3:], b[1:4]

(('사', '오'), (2, 3, '사'))

In [75]:
bc = ( 1,2,3,'사','칠')
cb =1,2,3,4

In [76]:
bc[3:],cb[1:4]

(('사', '칠'), (2, 3, 4))

## Dictionay{}

In [37]:
dic = {'name1' : '허때뻠','학번1':30300,'name2':'허떄빰','학번2':303000}
dic.get('name1')

'허때뻠'

In [39]:
dic.keys()

dict_keys(['name1', '학번1', 'name2', '학번2'])

In [41]:
dic.values()

dict_values(['허때뻠', 30300, '허떄빰', 303000])

## set{}

In [42]:
lunch ={'햄버거','치킨','라면','콜라',10000}
dinner = {'피자','족발','라면','콜라',10000}

In [43]:
lunch & dinner

{10000, '라면', '콜라'}

In [44]:
dinner | lunch

{10000, '라면', '족발', '치킨', '콜라', '피자', '햄버거'}

# 1. Pandas에 대해 이해하고 DataFrame을 생성할 수 있다.

## pandas의 두가지 기본 구조

- Vector 형태의 Series
- Matrix 형태의 DataFrame

In [45]:
import pandas as pd

In [48]:
s1 = pd.core.series.Series([1,2,3])
s2 = pd.core.series.Series(['일','이','삼'])
pd.DataFrame(data=dict(num=s1,word=s2))

   num word
0    1    일
1    2    이
2    3    삼

In [50]:
num_se = pd.Series([1,2,3,4,5])
num_df = pd.DataFrame([1,2,3,4,5],index=[1,2,3,4,5])

In [52]:
num_se

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [54]:
num_df

   0
1  1
2  2
3  3
4  4
5  5

# Dict를 이용한 DataFrame 생성

In [57]:
import pandas as pd

In [90]:
man = [
    {'name':'은주', 'age':20, 'job':'j1'},
    {'name':'민서', 'age':30, 'job':'j2'},
    {'name':'경민', 'age':15, 'job':'j1'}
]
df = pd.DataFrame(man,index = [1,2,3])
df

  name  age job
1   은주   20  j1
2   민서   30  j2
3   경민   15  j1

In [96]:
man_2 = {
    '이름':['은주','소주','은주','은주'],
    '나이':[30,40,10,21],
    '직업':['j1','j1','j1','j1']
}

In [97]:
pd.DataFrame(man_2, index = [4,5,6,7])

   이름  나이  직업
4  은주  30  j1
5  소주  40  j1
6  은주  10  j1
7  은주  21  j1

In [84]:
num = (1,2,3)
menu = ("치킨","피자","고구마")

In [89]:
pd.DataFrame(data = [1,2,3,4,5], index = [1,2,3,4,5],columns=['이름'])

   이름
1   1
2   2
3   3
4   4
5   5

## 리스트의 프레임

In [101]:
person = [
    ['a',100,80],['b',17,60],['c',50,40],['d', 90,80]
]
df = pd.DataFrame(person)

In [102]:
df

   0    1   2
0  a  100  80
1  b   17  60
2  c   50  40
3  d   90  80

In [108]:
col_name = ['name','국어','영어']
df = pd.DataFrame(person,columns = col_name)
df

  name   국어  영어
0    a  100  80
1    b   17  60
2    c   50  40
3    d   90  80

In [109]:
df = pd.DataFrame(person,columns = col_name,index=[1,2,3,4])
df

  name   국어  영어
1    a  100  80
2    b   17  60
3    c   50  40
4    d   90  80

In [110]:
df[['국어','영어']]>70

      국어     영어
1   True   True
2  False  False
3  False  False
4   True   True

In [117]:
nyam = {
    '3식':['아침','점심','저녁'],
    '메뉴':['삼겹살','치킨','피자']
}
df = pd.DataFrame(nyam, index = [1,2,3])
df

   3식   메뉴
1  아침  삼겹살
2  점심   치킨
3  저녁   피자